ECHECK DEBITS Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>{{MerchantID}}</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{TransactionSecurityKey}}</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-{{Version}}">
       <merchantID>{{MerchantID}}</merchantID>
      <merchantReferenceCode>{{$timestamp}}</merchantReferenceCode>
            <billTo>
                <firstName>First</firstName>
                <lastName>Last</lastName>
                <street1>1234 Address</street1>
                <city>City</city>
                <state>ID</state>
                <postalCode>12345</postalCode>
                <country>US</country>
                <phoneNumber>9999999999</phoneNumber>
                <email>email@example.org</email>
            </billTo>
            <purchaseTotals>
                <currency>USD</currency>
                <grandTotalAmount>10.00</grandTotalAmount>
            </purchaseTotals>
            <check>
                <accountNumber>4100</accountNumber>
                <accountType>c</accountType>
                <bankTransitNumber>071923284</bankTransitNumber>
            </check>
            <ecDebitService run="true"/>
        </requestMessage>
    </soapenv:Body>
</soapenv:Envelope>